Reports/ИА_ФинансоваяДирективаРасшифровка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Report>
		<Properties>
			<Name>ИА_ФинансоваяДирективаРасшифровка</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СсылкаНаОбъект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИА_ФинансовоеПланирование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccumulationRegisters/ИА_СредстваНаФондах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ИА_СредстваНаФондах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаНал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБезнал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КСУ_ОперацииПоФондам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПояснениеТекст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПояснениеСсылка</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_ЦФО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_Фонды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ИА_СредстваВРезервеНаФондах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ИА_СредстваВРезервеНаФондах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаНал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБезнал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_ЦФО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗП</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИА_ЗаказНаПриобретение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_Фонды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ИА_ЗаказНаПриобретение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ИА_ЗаказНаПриобретение</Name>
			<BasedOn>
				<xr:Item>Task.ИА_ЗадачаПланаДействий</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ИА_ИсторияСтатусовЗВС</xr:Item>
				<xr:Item>AccumulationRegister.ИА_ЗаказыНаПриобретение</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ситуация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Решение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_Фонды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_ЦФО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_СостояниеЗаказа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметЗаказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_ВидДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаМесяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаНеделю</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИА_ЗаявкаНаОбязательства</v8:Type>
						<v8:Type>cfg:TaskRef.ИА_ЗадачаПланаДействий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганизацияДочерняя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НФ_Заказ</Name>
					<Type>
						<v8:Type>cfg:BusinessProcessRef.ИА_БПНоситель</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДССправочно</Name>
					<Comment>Используется только когда отключен раздельный учет нал/безнал. Ни на что не влияет. </Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_ВидДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КСУ_СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВеб</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПереченьТоваровУслуг</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДокументыОснования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ссылки</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Файлы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Записан</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерЗВС</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>12</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответственный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Зарплата</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Лента</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Событие</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Детали</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответственный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Reports/ИА_ФинансоваяДирективаРасшифровка/Ext/ObjectModule.bsl
Функция Печать() Экспорт
	
	ФПпоТБ = ИА_ФП_ПовторИсп.ФП_по_ТБ(СсылкаНаОбъект.Дата);
	ИспПодразделения = Константы.КСУ_ФП_ИспользоватьПодразделения.Получить();
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ИА_ФинансовоеПланирование_Директива_Расшифровка";
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПодЗапрос.Подразделение КАК Подразделение,
	               |	ПодЗапрос.Фонд КАК Фонд,
	               |	ПодЗапрос.Заказ КАК Заказ,
	               |	СУММА(ПодЗапрос.ДоФП_ОстатокБезНал) КАК ДоФП_ОстатокБезнал,
	               |	СУММА(ПодЗапрос.ДоФП_РезервБезНал) КАК ДоФП_РезервБезнал,
	               |	СУММА(ПодЗапрос.ДоФП_ОстатокБезНал) + СУММА(ПодЗапрос.ДоФП_РезервБезНал) КАК ДоФП_Остаток_Итого,
	               |	СУММА(ПодЗапрос.ФП_РезервБезнал) КАК ФП_РезервБезнал,
	               |	СУММА(ПодЗапрос.ФП_ПриходБезнал) КАК ФП_ПриходБезнал,
	               |	СУММА(ПодЗапрос.ДоФП_ОстатокБезНал) + СУММА(ПодЗапрос.ФП_ПриходБезнал) - СУММА(ПодЗапрос.ФП_РезервБезнал) КАК ПослеФП_ОстатокБезнал,
	               |	СУММА(ПодЗапрос.ДоФП_РезервБезНал) + СУММА(ПодЗапрос.ФП_РезервБезнал) КАК ПослеФП_РезервБезнал,
	               |	СУММА(ПодЗапрос.ДоФП_ОстатокБезНал) + СУММА(ПодЗапрос.ФП_ПриходБезнал) + СУММА(ПодЗапрос.ДоФП_РезервБезНал) КАК ПослеФП_Остаток_Итого
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ЕСТЬNULL(ДенежныеСредстваОстатки.Подразделение, ДенежныеСредстваВРезервеОстатки.Подразделение) КАК Подразделение,
	               |		ЕСТЬNULL(ДенежныеСредстваОстатки.Фонд, ДенежныеСредстваВРезервеОстатки.Фонд) КАК Фонд,
	               |		&ПустойЗаказ КАК Заказ,
	               |		ЕСТЬNULL(ДенежныеСредстваОстатки.СуммаБезналОстаток,0) - ЕСТЬNULL(ДенежныеСредстваВРезервеОстатки.СуммаБезналОстаток, 0) КАК ДоФП_ОстатокБезНал,
	               |		ЕСТЬNULL(ДенежныеСредстваВРезервеОстатки.СуммаБезналОстаток, 0) КАК ДоФП_РезервБезНал,
	               |		0 КАК ФП_РезервБезнал,
	               |		0 КАК ФП_ПриходБезнал
	               |	ИЗ
	               |		РегистрНакопления.ИА_СредстваНаФондах.Остатки(
	               |				&ДатаДо,
	               |				Организация = &Организация
	               |					ИЛИ &НеРазделять) КАК ДенежныеСредстваОстатки
	               |			ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.ИА_СредстваВРезервеНаФондах.Остатки(
	               |					&ДатаДо,
	               |					Организация = &Организация
	               |						ИЛИ &НеРазделять) КАК ДенежныеСредстваВРезервеОстатки
	               |			ПО ДенежныеСредстваОстатки.Подразделение = ДенежныеСредстваВРезервеОстатки.Подразделение
	               |				И ДенежныеСредстваОстатки.Фонд = ДенежныеСредстваВРезервеОстатки.Фонд
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ИА_СредстваВРезервеНаФондах.Подразделение,
	               |		ИА_СредстваВРезервеНаФондах.Фонд,
	               |		ИА_СредстваВРезервеНаФондах.ЗП,
	               |		0,
	               |		0,
	               |		ИА_СредстваВРезервеНаФондах.СуммаБезнал,
	               |		0
	               |	ИЗ
	               |		РегистрНакопления.ИА_СредстваВРезервеНаФондах КАК ИА_СредстваВРезервеНаФондах
	               |	ГДЕ
	               |		ИА_СредстваВРезервеНаФондах.Регистратор = &ТекДок
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ИА_СредстваНаФондахОбороты.Подразделение,
	               |		ИА_СредстваНаФондахОбороты.Фонд,
	               |		&ПустойЗаказ,
	               |		0,
	               |		0,
	               |		0,
	               |		ИА_СредстваНаФондахОбороты.СуммаБезналОборот
	               |	ИЗ
	               |		РегистрНакопления.ИА_СредстваНаФондах.Обороты(, , Регистратор, ) КАК ИА_СредстваНаФондахОбороты
	               |	ГДЕ
	               |		ИА_СредстваНаФондахОбороты.Регистратор = &ТекДок) КАК ПодЗапрос
	               |ГДЕ
	               |	ПодЗапрос.Фонд <> &ПустойФонд
	               |	И (ПодЗапрос.ДоФП_ОстатокБезНал <> 0
	               |			ИЛИ ПодЗапрос.ДоФП_РезервБезНал <> 0
	               |			ИЛИ ПодЗапрос.ФП_РезервБезнал <> 0
	               |			ИЛИ ПодЗапрос.ФП_ПриходБезнал <> 0)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПодЗапрос.Подразделение,
	               |	ПодЗапрос.Фонд,
	               |	ПодЗапрос.Заказ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	%Порядок%
	               |ИТОГИ
	               |	СУММА(ДоФП_ОстатокБезнал),
	               |	СУММА(ДоФП_РезервБезнал),
	               |	СУММА(ДоФП_Остаток_Итого),
	               |	СУММА(ФП_РезервБезнал),
	               |	СУММА(ФП_ПриходБезнал),
	               |	СУММА(ПослеФП_ОстатокБезнал),
	               |	СУММА(ПослеФП_РезервБезнал),
	               |	СУММА(ПослеФП_Остаток_Итого)
	               |ПО
	               |	ОБЩИЕ,
	               |	%итог% ";
	
		
	упор = "ПодЗапрос.Подразделение.Наименование,	ПодЗапрос.Фонд.Код";
	итогиПо = "Подразделение,	Фонд, Заказ";
	Если не ИспПодразделения ТОгда
		упор = "ПодЗапрос.Фонд.Код";
		итогиПо = "Фонд,Заказ";
	КонецЕсли;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%Порядок%", упор);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%итог%", итогиПо);
	
	ФППоОрганизациям              = Константы.ИА_ФП_ВестиФППоОрганизациям.Получить();
	Запрос.УстановитьПараметр("НеРазделять", не ФППоОрганизациям);
	
	Запрос.УстановитьПараметр("ТекДок", СсылкаНаОбъект);
	Запрос.УстановитьПараметр("Организация", СсылкаНаОбъект.Организация);
	Запрос.УстановитьПараметр("ДатаДо", СсылкаНаОбъект.Дата);
	Запрос.УстановитьПараметр("ДатаПосле", СсылкаНаОбъект.Дата + 1);
	Запрос.УстановитьПараметр("ПустойЗаказ", Документы.ИА_ЗаказНаПриобретение.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустойФонд", Справочники.ИА_Фонды.ПустаяСсылка());
	Запрос.УстановитьПараметр("ЭтоРСФ", иа_фп.ЭтоРСФ());
	
	Если Константы.ИА_ФП_РазделятьНалИБезнал.Получить() Тогда
		Макет = ПолучитьМакет("СостояниеФондов");
	Иначе
		Макет = ПолучитьМакет("СостояниеФондовСвернуто");
	КонецЕсли;
    
    ДатаНачалаОтчета =  ?(СсылкаНаОбъект.НачалоПланирования,СсылкаНаОбъект.Дата,СсылкаНаОбъект.Дата + 60*60*24);

	
	Если ФПпоТБ Тогда
		ОблШапка = Макет.ПолучитьОбласть("Шапка1");
		ОблШапка.Параметры.Номер = СсылкаНаОбъект.Номер;
		ОблШапка.Параметры.Дата = Формат(СсылкаНаОбъект.Дата, "ДФ='dd MMMM yyyy ""г.""'");    
		ТабДокумент.Вывести(ОблШапка);
	Иначе
		ОблШапка = Макет.ПолучитьОбласть("Шапка");
		ОблШапка.Параметры.Номер = Число(Прав(СсылкаНаОбъект.Номер,5));
	    
		ОблШапка.Параметры.ДатаНачала = Формат(ДатаНачалаОтчета, "ДФ='dd MMMM yyyy ""г.""'");    
		ОблШапка.Параметры.ДатаКонца = Формат(ДатаНачалаОтчета + 60*60*24*6 , "ДФ='dd MMMM yyyy ""г.""'");
		ОблШапка.Параметры.СуммаКРаспределению = СсылкаНаОбъект.СуммаКРаспределениюСОстаткомНал + СсылкаНаОбъект.СуммаКРаспределениюСОстаткомБезнал;
		ОблШапка.Параметры.Организация = ВРЕГ(СсылкаНаОбъект.Организация);
		ТабДокумент.Вывести(ОблШапка);
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	ВыводитьИтог =Ложь;
	Пока Выборка.Следующий() Цикл
		Если Выборка.ТипЗаписи() = ТипЗаписиЗапроса.ДетальнаяЗапись Тогда
			Продолжить;
		КонецЕсли;
		
		ВыводитьИтог = Истина;
		Если Выборка.ТипЗаписи() = ТипЗаписиЗапроса.ОбщийИтог Тогда
			ОблСтрокаИтог = Макет.ПолучитьОбласть("СтрокаИтог");
			ОблСтрокаИтог.Параметры.Заполнить(Выборка);
			Продолжить;
		КонецЕсли;
				
		Если Выборка.Фонд = null Тогда // Подразделение
			ОблСтрока = Макет.ПолучитьОбласть("СтрокаПодразделение");
		ИначеЕсли Выборка.Фонд <> null и Выборка.Заказ  = null Тогда // фонд
			Если ИспПодразделения Тогда
				ОблСтрока = Макет.ПолучитьОбласть("СтрокаФондПодр");
			Иначе
				ОблСтрока = Макет.ПолучитьОбласть("СтрокаФонд");
			КонецЕсли;
		Иначе
			Если Выборка.Заказ.Пустая() Тогда
				Продолжить;
			КонецЕсли;
			
			Если ИспПодразделения Тогда
				ОблСтрока = Макет.ПолучитьОбласть("СтрокаЗаказПодр");			
			Иначе
				ОблСтрока = Макет.ПолучитьОбласть("СтрокаЗаказ");			
			КонецЕсли;
			ОблСтрока.Параметры.описание = Выборка.Заказ.ПредметЗаказа;
		КонецЕсли;
		
		ОблСтрока.Параметры.Заполнить(Выборка);
		ТабДокумент.Вывести(ОблСтрока);
	КонецЦикла;
	
	Если ВыводитьИтог Тогда
		ТабДокумент.Вывести(ОблСтрокаИтог);
	КонецЕсли;
	
	ОблПодвал = Макет.ПолучитьОбласть("Подвал");
	ТабДокумент.Вывести(ОблПодвал);
	
	ТабДокумент.ОриентацияСтраницы=ОриентацияСтраницы.Ландшафт;
	ТабДокумент.АвтоМасштаб=Истина;
	
	Возврат ТабДокумент;
	
	//ВыборкаРКО = ПолучитьСписокРКО();
	
КонецФункции
